admindashboardreport/statistics.json
{
  "12 - Verify Product Cleanup" : {
    "transaction" : "12 - Verify Product Cleanup",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 24.78,
    "medianResTime" : 23.5,
    "minResTime" : 16.0,
    "maxResTime" : 40.0,
    "pct1ResTime" : 32.0,
    "pct2ResTime" : 36.24999999999998,
    "pct3ResTime" : 40.0,
    "throughput" : 0.5853841290654928,
    "receivedKBytesPerSec" : 2.7273069439728848,
    "sentKBytesPerSec" : 0.23895563080993748
  },
  "01 - Admin Login for Products" : {
    "transaction" : "01 - Admin Login for Products",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 89.62,
    "medianResTime" : 92.0,
    "minResTime" : 62.0,
    "maxResTime" : 113.0,
    "pct1ResTime" : 97.0,
    "pct2ResTime" : 102.35,
    "pct3ResTime" : 113.0,
    "throughput" : 0.6181386608644052,
    "receivedKBytesPerSec" : 0.4020315899762634,
    "sentKBytesPerSec" : 0.24991152890416377
  },
  "02 - Generate Random Product Data" : {
    "transaction" : "02 - Generate Random Product Data",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3.44,
    "medianResTime" : 3.0,
    "minResTime" : 0.0,
    "maxResTime" : 14.0,
    "pct1ResTime" : 6.0,
    "pct2ResTime" : 7.449999999999996,
    "pct3ResTime" : 14.0,
    "throughput" : 0.6210177238458386,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.0
  },
  "09 - Product Edit Complete" : {
    "transaction" : "09 - Product Edit Complete",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.3000000000000003,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 5.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 4.449999999999996,
    "pct3ResTime" : 5.0,
    "throughput" : 0.6106199013238239,
    "receivedKBytesPerSec" : 0.10324485323750672,
    "sentKBytesPerSec" : 0.0
  },
  "10 - Delete Product" : {
    "transaction" : "10 - Delete Product",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 16.839999999999996,
    "medianResTime" : 15.0,
    "minResTime" : 9.0,
    "maxResTime" : 35.0,
    "pct1ResTime" : 26.0,
    "pct2ResTime" : 27.449999999999996,
    "pct3ResTime" : 35.0,
    "throughput" : 0.6185592517907291,
    "receivedKBytesPerSec" : 0.19571601326191035,
    "sentKBytesPerSec" : 0.28270090804498166
  },
  "13 - Product Cleanup Verification Results" : {
    "transaction" : "13 - Product Cleanup Verification Results",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3.0600000000000005,
    "medianResTime" : 3.0,
    "minResTime" : 1.0,
    "maxResTime" : 13.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 4.449999999999996,
    "pct3ResTime" : 13.0,
    "throughput" : 0.5810980428617917,
    "receivedKBytesPerSec" : 0.1749422897006183,
    "sentKBytesPerSec" : 0.0
  },
  "08 - Edit Product" : {
    "transaction" : "08 - Edit Product",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 41.97999999999999,
    "medianResTime" : 42.5,
    "minResTime" : 31.0,
    "maxResTime" : 55.0,
    "pct1ResTime" : 51.0,
    "pct2ResTime" : 54.449999999999996,
    "pct3ResTime" : 55.0,
    "throughput" : 0.6062663691919682,
    "receivedKBytesPerSec" : 0.44163899944829765,
    "sentKBytesPerSec" : 1.0220206365493745
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 650,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 19.79538461538461,
    "medianResTime" : 11.0,
    "minResTime" : 0.0,
    "maxResTime" : 113.0,
    "pct1ResTime" : 48.0,
    "pct2ResTime" : 89.0,
    "pct3ResTime" : 96.49000000000001,
    "throughput" : 4.737920125955784,
    "receivedKBytesPerSec" : 3.646305037320232,
    "sentKBytesPerSec" : 1.9836125479258844
  },
  "05 - Verify Created Product" : {
    "transaction" : "05 - Verify Created Product",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 21.299999999999997,
    "medianResTime" : 19.0,
    "minResTime" : 14.0,
    "maxResTime" : 47.0,
    "pct1ResTime" : 29.799999999999997,
    "pct2ResTime" : 37.34999999999999,
    "pct3ResTime" : 47.0,
    "throughput" : 0.6291761567403641,
    "receivedKBytesPerSec" : 0.4674827998968151,
    "sentKBytesPerSec" : 0.2781155230341391
  },
  "11 - Complete Product CRUD Operations" : {
    "transaction" : "11 - Complete Product CRUD Operations",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.280000000000001,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 6.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 5.0,
    "pct3ResTime" : 6.0,
    "throughput" : 0.6043245464544279,
    "receivedKBytesPerSec" : 0.16983644333853054,
    "sentKBytesPerSec" : 0.0
  },
  "02 - Get Categories for Product" : {
    "transaction" : "02 - Get Categories for Product",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 12.560000000000002,
    "medianResTime" : 12.0,
    "minResTime" : 7.0,
    "maxResTime" : 32.0,
    "pct1ResTime" : 18.799999999999997,
    "pct2ResTime" : 27.349999999999987,
    "pct3ResTime" : 32.0,
    "throughput" : 0.6303500964435648,
    "receivedKBytesPerSec" : 0.835336993040935,
    "sentKBytesPerSec" : 0.25854203174443086
  },
  "04 - Create New Product" : {
    "transaction" : "04 - Create New Product",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 34.36000000000001,
    "medianResTime" : 31.5,
    "minResTime" : 22.0,
    "maxResTime" : 70.0,
    "pct1ResTime" : 49.49999999999999,
    "pct2ResTime" : 61.04999999999996,
    "pct3ResTime" : 70.0,
    "throughput" : 0.6258840612364965,
    "receivedKBytesPerSec" : 0.4369208616545871,
    "sentKBytesPerSec" : 1.0234426831023822
  },
  "06 - Product Creation Complete" : {
    "transaction" : "06 - Product Creation Complete",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.0399999999999996,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 6.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 4.449999999999996,
    "pct3ResTime" : 6.0,
    "throughput" : 0.6267313453415059,
    "receivedKBytesPerSec" : 0.08340912865541057,
    "sentKBytesPerSec" : 0.0
  },
  "07 - Generate Updated Product Data" : {
    "transaction" : "07 - Generate Updated Product Data",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.7800000000000002,
    "medianResTime" : 3.0,
    "minResTime" : 0.0,
    "maxResTime" : 6.0,
    "pct1ResTime" : 4.899999999999999,
    "pct2ResTime" : 5.0,
    "pct3ResTime" : 6.0,
    "throughput" : 0.6214190725941761,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.0
  }
}