profilereport/statistics.json
{
  "01 - User Role Assignment" : {
    "transaction" : "01 - User Role Assignment",
    "sampleCount" : 15,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.8,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 8.0,
    "pct1ResTime" : 6.200000000000001,
    "pct2ResTime" : 8.0,
    "pct3ResTime" : 8.0,
    "throughput" : 1.6051364365971108,
    "receivedKBytesPerSec" : 0.21945224719101122,
    "sentKBytesPerSec" : 0.0
  },
  "07 - Profile Update Completion" : {
    "transaction" : "07 - Profile Update Completion",
    "sampleCount" : 15,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.2666666666666668,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 3.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 3.0,
    "throughput" : 1.6270745200130166,
    "receivedKBytesPerSec" : 0.31736427486712226,
    "sentKBytesPerSec" : 0.0
  },
  "06 - Update Profile" : {
    "transaction" : "06 - Update Profile",
    "sampleCount" : 15,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 19.599999999999998,
    "medianResTime" : 19.0,
    "minResTime" : 15.0,
    "maxResTime" : 31.0,
    "pct1ResTime" : 27.400000000000002,
    "pct2ResTime" : 31.0,
    "pct3ResTime" : 31.0,
    "throughput" : 1.621796951021732,
    "receivedKBytesPerSec" : 1.0778192236998594,
    "sentKBytesPerSec" : 0.9045530260028111
  },
  "04 - Use Profile Information from Login" : {
    "transaction" : "04 - Use Profile Information from Login",
    "sampleCount" : 15,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.9333333333333336,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 3.0,
    "pct1ResTime" : 2.4000000000000004,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 3.0,
    "throughput" : 1.6235523325035177,
    "receivedKBytesPerSec" : 0.2762998565862106,
    "sentKBytesPerSec" : 0.0
  },
  "Admin Navigate to Cart Page" : {
    "transaction" : "Admin Navigate to Cart Page",
    "sampleCount" : 6,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.1666666666666665,
    "medianResTime" : 1.0,
    "minResTime" : 1.0,
    "maxResTime" : 2.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 2.0,
    "throughput" : 1.86046511627907,
    "receivedKBytesPerSec" : 0.24527616279069767,
    "sentKBytesPerSec" : 0.0
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 135,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 12.792592592592593,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 106.0,
    "pct1ResTime" : 69.80000000000007,
    "pct2ResTime" : 91.39999999999998,
    "pct3ResTime" : 102.75999999999988,
    "throughput" : 14.272121788772598,
    "receivedKBytesPerSec" : 4.47614375198224,
    "sentKBytesPerSec" : 1.34410267337985
  },
  "02 - User Login" : {
    "transaction" : "02 - User Login",
    "sampleCount" : 15,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 86.8,
    "medianResTime" : 91.0,
    "minResTime" : 64.0,
    "maxResTime" : 106.0,
    "pct1ResTime" : 100.60000000000001,
    "pct2ResTime" : 106.0,
    "pct3ResTime" : 106.0,
    "throughput" : 1.5976142294174034,
    "receivedKBytesPerSec" : 1.044169872989669,
    "sentKBytesPerSec" : 0.46305849930770054
  },
  "User Navigate to Dashboard" : {
    "transaction" : "User Navigate to Dashboard",
    "sampleCount" : 9,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.5555555555555556,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.680672268907563,
    "receivedKBytesPerSec" : 0.22923231792717086,
    "sentKBytesPerSec" : 0.0
  },
  "05 - Prepare Profile Updates" : {
    "transaction" : "05 - Prepare Profile Updates",
    "sampleCount" : 15,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.0000000000000002,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 3.0,
    "pct1ResTime" : 2.4000000000000004,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 3.0,
    "throughput" : 1.6242555495397943,
    "receivedKBytesPerSec" : 0.3917882038440715,
    "sentKBytesPerSec" : 0.0
  },
  "Admin Click Update Address" : {
    "transaction" : "Admin Click Update Address",
    "sampleCount" : 6,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.8333333333333334,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 2.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 2.0,
    "throughput" : 1.8610421836228288,
    "receivedKBytesPerSec" : 0.33804086538461536,
    "sentKBytesPerSec" : 0.0
  },
  "08 - Final Profile Management Report" : {
    "transaction" : "08 - Final Profile Management Report",
    "sampleCount" : 15,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.2666666666666668,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 3.0,
    "pct1ResTime" : 2.4000000000000004,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 3.0,
    "throughput" : 1.6276041666666667,
    "receivedKBytesPerSec" : 0.7352828979492189,
    "sentKBytesPerSec" : 0.0
  },
  "User Click Profile" : {
    "transaction" : "User Click Profile",
    "sampleCount" : 9,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.5555555555555556,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.680672268907563,
    "receivedKBytesPerSec" : 0.2866771708683473,
    "sentKBytesPerSec" : 0.0
  }
}